In [8]:
class Student:
    def __init__(self, name, age):
        self.__name = name  # Private attribute
        self.__age = age  # Private attribute

    def get_name(self):
        return self.__name

    def set_name(self, name):
        self.__name = name

    def get_age(self):
        return self.__age

    def set_age(self, age):
        if age >= 0:
            self.__age = age
        else:
            print("Age cannot be negative!")


# Creating an instance of the Student class
student1 = Student("Alice", 20)

In [12]:
student1.set_name('Rafael')

In [13]:
student1.get_name()

'Rafael'

In [1]:
import pandas as pd

In [3]:
import pandas as pd
import numpy as np

# Set the random seed for reproducibility
np.random.seed(42)

# Generate random data
data = {
    'ID': np.arange(1, 11),  # 10 IDs
    'Name': [f'Name_{i}' for i in range(1, 11)],  # 10 names (Name_1, Name_2, ...)
    'Age': np.random.randint(18, 65, size=10),  # Random ages between 18 and 65
    'Salary': np.random.uniform(3000, 10000, size=10).round(2),  # Random salaries between 3000 and 10000
    'Joined': pd.date_range(start='2020-01-01', periods=10, freq='M'),  # Date range (monthly dates)
}

# Create the DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
df

   ID     Name  Age   Salary     Joined
0   1   Name_1   56  6214.74 2020-01-31
1   2   Name_2   46  5335.96 2020-02-29
2   3   Name_3   32  4000.07 2020-03-31
3   4   Name_4   60  7556.22 2020-04-30
4   5   Name_5   25  3394.88 2020-05-31
5   6   Name_6   38  8053.99 2020-06-30
6   7   Name_7   56  9569.87 2020-07-31
7   8   Name_8   36  3005.45 2020-08-31
8   9   Name_9   40  9945.48 2020-09-30
9  10  Name_10   28  7322.37 2020-10-31

In [1]:
import pandas as pd

# Data
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda', 'Dina', 'Kate', 'Tom', 'Emily'],
    'Age': [22, 78, 22, 30, 45, 30, 35, 40],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Female', 'Female', 'Male', 'Female'],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio', 'San Diego'],
    'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Nurse', 'Architect', 'Lawyer', 'Accountant', 'Scientist']
}

# Create a DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
df

    Name  Age  Gender          City  Occupation
0   John   22    Male      New York    Engineer
1   Anna   78  Female   Los Angeles      Doctor
2  Peter   22    Male       Chicago     Teacher
3  Linda   30  Female       Houston       Nurse
4   Dina   45  Female       Phoenix   Architect
5   Kate   30  Female  Philadelphia      Lawyer
6    Tom   35    Male   San Antonio  Accountant
7  Emily   40  Female     San Diego   Scientist